
username = 'Джек'           # username - имя пользователя
title = 'Задача 1'          # title - заголовок заметки
content = 'Присвоить соответствующие значения и напечатать с помощью функции print'         # content - описание заметки
status = 'В работе'         # status - статус заметки
created_date = '06-12-2024'         # created_date - дата создания заметки в формате "день-месяц-год", например "10-11-2024"
issue_date = '07-12-2024'           # issue_date - дата истечения заметки (дедлайн) в формате "день-месяц-год", например "10-12-2024"

print('Имя пользователя:', username)
print('Заголовок заметки:', title)
print('Описание заметки:', content)
print('Статус заметки:', status)
print('Дата Создания заметки в формате "день-месяц-год":', created_date)
print('Дата Истечения заметки (дедлайн) в формате "день-месяц-год":', issue_date)